# Базовый образ - Node.js версии 20 на Alpine Linux (легковесный дистрибутив)
FROM node:20-alpine

# Создаем рабочую директорию в контейнере
WORKDIR /usr/src/app

# Копируем файлы package.json и package-lock.json (если есть) в рабочую директорию
COPY package*.json ./

# Устанавливаем зависимости проекта
RUN npm install

# Копируем ВСЕ остальные файлы из текущей директории в рабочую директорию контейнера
COPY . .

# Объявляем, что контейнер будет слушать указанный порт (не пробрасывает его автоматически)
EXPOSE 3000

# Команда для запуска приложения при старте контейнера
CMD ["node", "app.js"]
